$$JOBCARD
/*
//* ------------------------------------------------------------------
//*              RUN                       ---------------------------
//* ------------------------------------------------------------------
//RUNPGM   EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD DSN=DB2.$$subsystem.SDSNLOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSIN DD *
DSN SYSTEM($$subsystem)
RUN PROGRAM(CUSTDB) PLAN(DBPLAN)  -
 LIB('$$HLQ.TEST4ZDB.BATCHAPP.LOADLIB')
END
