       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTDB.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
      *    EXEC SQL INCLUDE SQLCA    END-EXEC.
       01 SQLCA GLOBAL VOLATILE.
           05 SQLCAID PIC X(8).
           05 SQLCABC PIC S9(9) COMP-5.
           05 SQLCODE PIC S9(9) COMP-5.
           05 SQLERRM.
             49 SQLERRML PIC S9(4) COMP-5.
             49 SQLERRMC PIC X(70).
           05 SQLERRP PIC X(8).
           05 SQLERRD PIC S9(9) COMP-5
                      OCCURS 6 TIMES.
           05 SQLWARN.
             10 SQLWARN0 PIC X.
             10 SQLWARN1 PIC X.
             10 SQLWARN2 PIC X.
             10 SQLWARN3 PIC X.
             10 SQLWARN4 PIC X.
             10 SQLWARN5 PIC X.
             10 SQLWARN6 PIC X.
             10 SQLWARN7 PIC X.
           05 SQLEXT.
             10 SQLWARN8 PIC X.
             10 SQLWARN9 PIC X.
             10 SQLWARNA PIC X.
             10 SQLSTATE PIC X(5).
       01 WS-CURRENT-DATE-DATA.
           05  WS-CURRENT-DATE.
               10  WS-CURRENT-YEAR         PIC 9(04).
               10  WS-CURRENT-MONTH        PIC 9(02).
               10  WS-CURRENT-DAY          PIC 9(02).
           05  WS-CURRENT-TIME.
               10  WS-CURRENT-HOURS        PIC 9(02).
               10  WS-CURRENT-MINUTE       PIC 9(02).
               10  WS-CURRENT-SECOND       PIC 9(02).
               10  WS-CURRENT-MILLISECONDS PIC 9(02).
       01 WS-CURREN-DATE PIC X(10).
      *
       PROCEDURE DIVISION.
           MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-DATA.
           DISPLAY 'CURRENT DATE IS ' WS-CURRENT-DATE-DATA.
           MOVE WS-CURRENT-YEAR TO WS-CURREN-DATE(1:4).
           MOVE '-' TO WS-CURREN-DATE(5:1).
           MOVE WS-CURRENT-MONTH TO WS-CURREN-DATE(6:2).
           MOVE '-' TO WS-CURREN-DATE(8:1).
           MOVE WS-CURRENT-DAY TO WS-CURREN-DATE(9:2).
           DISPLAY 'NOTIFICATION DATE 2 IS ' WS-CURREN-DATE.
           EXEC SQL
             UPDATE $$HLQ.$$tablename SET NOTIFICATION_DATE
             = :WS-CURREN-DATE
             WHERE (((TOTAL_CHECKS = 30 AND ACTUAL_CHECKS <=3) OR
                   (TOTAL_CHECKS = 50 AND ACTUAL_CHECKS <=5) OR
                   (TOTAL_CHECKS = 80 AND ACTUAL_CHECKS <=8)) AND
                   PRODUCT_TYPE IN ("S","C"))
           END-EXEC.
           IF SQLCODE = 0 THEN
             DISPLAY "SUCCESS"
             ELSE DISPLAY SQLSTATE
           END-IF.
           STOP RUN.